app/controllers/players_controller.rb

  def create
    @player = Player.new(params[:player])
    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Wed, 19 Jun 2013 17:53:13 UTC +00:00], ["name", "Testi"], ["updated_at", Wed, 19 Jun 2013 17:53:13 UTC +00:00]]

  def destroy
    @player = Player.find(params[:id])
    @player.destroy
---
SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "players" WHERE "players"."id" = $1  [["id", 1]]